Repository: joecare99/PicPas
Catalog: language/PicPas.*.po
Languages: de, es, fr, uk

# ProcAsm.ER_EXPEC_COMMA
source: Expected ",".
de: "," erwartet.
es: Se esperaba ","

# ProcAsm.ER_EXP_ADR_VAR
source: Expected address or variable name.
de: Adresse oder Variablenname erwartete.
es: Se esperaba dirección o variable.

# ProcAsm.ER_EXP_CON_VAL
source: Expected constant or value.
de: Konstante oder Wert erwartet.
es: Se esperaba constante o variable.

# ProcAsm.ER_NOGETADD_VAR
source: Cannot get address of this Variable
de: Kann Adresse dieser Variable nicht ermitteln
es: No se puede obtener la dirección de esta variable.

# ProcAsm.ER_NOGETVAL_CON
source: Cannot get value of this costant
de: Kann den Wert dieser Konstanten nicht ermitteln
es: No se puede obtener el valor de esta constante.

# ProcAsm.ER_INV_ASMCODE
source: Invalid ASM Opcode: %s
de: Ungültige ASM Opcode: %s
es: Instrucción inválida: %s

# ProcAsm.ER_EXPECT_W_F
source: Expected "w" or "f".
de: "w" oder "f" erwartet.
es: Se esperaba "w" or "f".

# ProcAsm.ER_SYNTAX_ERR_
source: Syntax error: "%s"
de: Syntax-Fehler: "%s"
es: Error de sintaxis: "%s"

# ProcAsm.ER_DUPLIC_LBL_
source: Duplicated label: "%s"
de: Dupliziertes Label: "%s"
es: Etiqueta duplicada: "%s"

# ProcAsm.ER_EXPE_NUMBIT
source: Expected number of bit: 0..7.
de: Bitnummer erwarted: 0..7.
es: Se esperaba número de bit: 0..7

# ProcAsm.ER_EXPECT_ADDR
source: Expected address.
de: Adresse erwarted.
es: Se esperaba dirección

# ProcAsm.ER_EXPECT_BYTE
source: Expected byte.
de: Byte erwartet.
es: Se esperaba byte

# ProcAsm.ER_UNDEF_LABEL_
source: Undefined ASM Label: %s
de: Undefiniertes ASM Label:%s
es: Etiqueta ASM indefinida: %s

# ProcAsm.WA_ADDR_TRUNC
source: Address truncated to fit instruction.
de: Adresse abgeschnitten, um in Anweisung zu passen.
es: Dirección truncada, al tamaño de la instrucción

# ParserDirec.ER_ERROR_DIREC
source: Error in directive.
de: Fehler bei Direktive.
es: Error en directiva
fr: Directive erronnée.
uk: Помилка директиви.

# ParserDirec.ER_UNKNO_DEVIC
source: Unknown device: %s
de: Unbekanntes Gerät: %s
es: Dispositivo desconocido: %s
fr: Modèle inconnu : %s
uk: Невизначений прилад: %s

# ParserDirec.ER_MODE_UNKNOWN
source: Mode unknown: %s
de: Unbekannter Modus: %s
es: Modo inválido
fr: Mode inconnu : %s
uk: Невизначений режим: %s

# ParserDirec.ER_UNKNO_DIREC
source: Unknown directive: %s
de: Unbekannte Direktive: %s
es: Directiva desconocida: %s
fr: Directive inconnue : %s
uk: Невизначена директива: %s

# ParserDirec.ER_ERROR_FREQ
source: Error in frequency.
de: Fehler bei der Frequenz.
es: Error en frecuencia.
fr: Erreur de fréquence.
uk: Помилка в частоті.

# ParserDirec.ER_IDENT_EXPEC
source: Identifier expected.
de: Bezeichner erwartet.
es: Identificador esperado.
fr: Identifiant attendu.
uk: Очікується ідентифікатор.

# ParserDirec.ER_EXPEC_EQUAL
source: Expected "="
de: "=" erwartet.
es: Se esperaba "="
fr: Attendu: "="
uk: Очікується "="

# ParserDirec.ER_SYNTAX_ERRO
source: Syntax error.
de: Syntaxfehler.
es: Error de sintaxis.
fr: Erreur de syntaxe.
uk: Помилка синтаксиса.

# ParserDirec.ER_SYNTAX_ERR_
source: Syntax error: "%s"
de: Syntax-Fehler: "%s"
es: Error de sintaxis: "%s"
fr: Erreur de syntaxe : "%s".
uk: Помилка синтаксиса: "%s"

# ParserAsm.ER_EXPEC_COMMA
source: Expected ",".
de: "," erwartet.
es: Se esperaba ","
fr: Attendu ",".
uk: Очікується ",".

# ParserAsm.ER_EXP_ADR_VAR
source: Expected address or variable name.
de: Adresse oder Variablenname erwartete.
es: Se esperaba dirección o variable.
fr: Attendu: adresse ou nom de variable.
uk: Очікується адреса або змінна.

# ParserAsm.ER_EXP_CON_VAL
source: Expected constant or value.
de: Konstante oder Wert erwartet.
es: Se esperaba constante o variable.
fr: Attendu: constante ou valeur.
uk: Очікується константа або значення.

# ParserAsm.ER_NOGETADD_VAR
source: Cannot get address of this Variable
de: Kann Adresse dieser Variable nicht ermitteln
es: No se puede obtener la dirección de esta variable.
uk: Не можу отримати адресу цієї змінної

# ParserAsm.ER_NOGETVAL_CON
source: Cannot get value of this costant
de: Kann den Wert dieser Konstanten nicht ermitteln
es: No se puede obtener el valor de esta constante.

# ParserAsm.ER_INV_ASMCODE
source: Invalid ASM Opcode: %s
de: Ungültige ASM Opcode: %s
es: Instrucción inválida: %s
fr: Instruction ASM invalide: %s
uk: Невірна ASM інструкція: %s

# ParserAsm.ER_EXPECT_W_F
source: Expected "w" or "f".
de: "w" oder "f" erwartet.
es: Se esperaba "w" or "f".
fr: Attendu: "w" ou "f".
uk: Очікується "w" або "f".

# ParserAsm.ER_SYNTAX_ERR_
source: Syntax error: "%s"
de: Syntax-Fehler: "%s"
es: Error de sintaxis: "%s"
fr: Erreur de syntaxe: "%s"
uk: Помилка синтаксису: "%s"

# ParserAsm.ER_DUPLIC_LBL_
source: Duplicated label: "%s"
de: Dupliziertes Label: "%s"
es: Etiqueta duplicada: "%s"
fr: Label à double: %s
uk: Дублікат мітки: "%s"

# ParserAsm.ER_EXPE_NUMBIT
source: Expected number of bit: 0..7.
de: Bitnummer erwarted: 0..7.
es: Se esperaba número de bit: 0..7
fr: Position de bit attendue: 0..7
uk: Очікується номер біта 0..7

# ParserAsm.ER_EXPECT_ADDR
source: Expected address.
de: Adresse erwarted.
es: Se esperaba dirección
fr: Attendu: adresse.
uk: Очікується адреса.

# ParserAsm.ER_EXPECT_BYTE
source: Expected byte.
de: Byte erwartet.
es: Se esperaba byte
fr: Attendu: byte.
uk: Очікується байт.

# ParserAsm.ER_UNDEF_LABEL_
source: Undefined ASM Label: %s
de: Undefiniertes ASM Label:%s
es: Etiqueta ASM indefinida: %s
fr: Label ASM non défini: %s
uk: Невизначена ASM мітка: %s

# ParserAsm.WA_ADDR_TRUNC
source: Address truncated to fit instruction.
de: Adresse abgeschnitten, um in Anweisung zu passen.
es: Dirección truncada, al tamaño de la instrucción
fr: Adresse tronquée pour insertion dans l'instruction.
uk: Адресу скорочено відповідно до вказівки.

# Parser.ER_NOT_IMPLEM_
source: Not implemented: "%s"
de: Nicht implementiert: "%s"
es: No implementado: "%s"
fr: Non implémenté : "%s"
uk: Не впроваджено: "%s"

# Parser.ER_IDEN_EXPECT
source: Identifier expected.
de: Bezeichner erwartet.
es: Identificador esperado.
fr: Identifiant attendu.
uk: Очікується ідентифікатор.

# Parser.ER_DUPLIC_IDEN
source: Duplicated identifier: "%s"
de: Doppelter Platzhalter: "%s"
es: Identificador duplicado: "%s"
fr: Identifiant à double : "%s"
uk: Дубльований ідентифікатор: "%s"

# Parser.ER_INVAL_FLOAT
source: Unvalid float number.
de: Ungültige Gleitkommazahl.
es: Número decimal no válido.
fr: Nombre à virgule flottante invalide.
uk: Невірне число з плаваючою комою.

# Parser.ER_ERR_IN_NUMB
source: Error in number.
de: Fehler bei Nummer.
es: Error en número
fr: Nombre invalide.
uk: Помилка в числі.

# Parser.ER_NOTYPDEFNUM
source: No type defined to accommodate this number.
de: Kein Typ definiert.
es: No hay tipo definido para albergar a este número.
fr: Aucun type défini pour ce nombre.
uk: Для типу цього числа не визначено жодного типу

# Parser.ER_UNDEF_TYPE_
source: Undefined type "%s"
de: Undefinierter Typ "%s"
es: Tipo "%s" no definido.
fr: Type indéfini "%s"
uk: Невизначений тип "%s"

# Parser.ER_INV_MEMADDR
source: Invalid memory address.
de: Ungültige Speicheradresse.
es: Dirección de memoria inválida.
fr: Adresse mémoire invalide.
uk: Недійсна адреса памʼяті.

# Parser.ER_BIT_VAR_REF
source: A bit variable reference expected.
de: Es wird eine Bitvariablen-referenz erwartet.
es: Se esreraba referencia a una variable bit.
fr: Référence de bit attendue.
uk: Очікується біт-змінна.

# Parser.ER_INV_MAD_DEV
source: Invalid memory address for this device.
de: Ungültige Speicheradresse für dieses Gerät.
es: No existe esta dirección de memoria en este dispositivo.
uk: Недійсна адреса памʼяті для цього пристрою.

# Parser.ER_EXP_VAR_IDE
source: Identifier of variable expected.
de: Variablenbezeichner erwartet.
es: Se esperaba identificador de variable.
fr: Identifiant de variable attendu.
uk: Очікується фдентифікатор змінної.

# Parser.ER_UNKNOWN_ID_
source: Unknown identifier: %s
de: Unbekannter Bezeichner: %s
es: Identificador desconocido: %s
fr: Identifiant inconnu : %s
uk: Невідомий ідентифікатор: %s

# Parser.ER_IDE_CON_EXP
source: Identifier of constant expected.
de: Konstantenbezeichner erwartet.
es: Se esperaba identificador de constante
fr: Identifiant de constante attendu
uk: Очікується ідентифікатор константи.

# Parser.ER_NUM_ADD_EXP
source: Numeric address expected.
de: Numerische Adresse erwartet.
es: Se esperaba dirección numérica.
fr: Adresse numérique attendue.
uk: Очікується числова адреса.

# Parser.ER_IDE_TYP_EXP
source: Identifier of type expected.
de: Typenbezeichner erwartet.
es: Se esperaba identificador de tipo.
fr: Identifiant de type attendu.
uk: Очікується ідентифікатор типу.

# Parser.ER_SEM_COM_EXP
source: ":" or "," expected.
de: ":"oder"," erwartet.
es: Se esperaba ":" o ",".
fr: ":" ou "," attendus.
uk: ":" або "," очікується.

# Parser.ER_EQU_COM_EXP
source: "=" or "," expected.
de: "=" oder "," erwartet.
es: Se esperaba "=" o ","
fr: "=" ou "," attendus.
uk: "=" або "," очікується.

# Parser.ER_END_EXPECTE
source: "end" expected.
de: "End" erwartet.
es: Se esperaba "end".
fr: "end" attendu.
uk: "end" очікується.

# Parser.ER_EOF_END_EXP
source: Unexpected end of file. "end" expected.
de: Unerwartetes Dateiende. "end" erwartet.
es: Inesperado fin de archivo. Se esperaba "end".
fr: "end" attendu à la fin du fichier.
uk: Неочікуваний кінець файла. "end" очікується.

# Parser.ER_BOOL_EXPECT
source: Boolean expression expected.
de: Bool'scher Ausdruck erwartet.
es: Se esperaba expresión booleana.
fr: Expression booléenne attendue
uk: Очікується булевий вираз.

# Parser.ER_UNKN_STRUCT
source: Unknown structure.
de: Unbekannte Struktur.
es: Estructura desconocida.
fr: Structure inconnue.
uk: Невідома структура.

# Parser.ER_PROG_NAM_EX
source: Program name expected.
de: Name des Programms erwartet.
es: Se esperaba nombre de programa.
fr: Nom de programme attendu.
uk: Очікується імʼя програми.

# Parser.ER_COMPIL_PROC
source: There is a compilation in progress.
de: Es ist (noch) ein Kompiliervorgang aktiv.
es: Ya se está compilando un programa actualmente.
fr: Une compilation et en cours.
uk: Триває компіляція.

# Parser.ER_CON_EXP_EXP
source: Constant expression expected.
de: Konstanter Ausdruck erwartet.
es: Se esperaba una expresión constante
fr: Expression constante attendue.

# Parser.ER_NOT_AFT_END
source: Syntax error. Nothing should be after "END."
de: Syntax-Fehler. Es sollte nichts nach "END." kommen.
es: Error de sintaxis. Nada debe aparecer después de "END."
fr: Erreur de syntaxe. Rien ne devrait suivre "END."
uk: Синтаксична помилка. Нічого не повинно бути після "END."

# Parser.ER_ELS_UNEXPEC
source: "else" unexpected.
de: "else" nicht erwartet.
es: "else" inesperado
fr: "else" inattendu.
uk: "else" несподівано.

# Parser.ER_INST_NEV_EXE
source: Instruction will never execute.
de: Bereich wird niemals ausgeführt.
es: Esta instrucción no se ejecutará
fr: L'instruction ne sera jamais exécutée.
uk: Інструкція ніколи не виконуватиметься.

# Parser.ER_ONLY_ONE_REG
source: Only one REGISTER parameter is allowed.
de: Nur ein REGISTER Parameter erlaubt.
es: Solo se permite un parámetro REGISTER.
fr: Un seul paramètre REGISTRE est autorisé.
uk: Дозволено тільки один параметр REGISTER.

# Parser.ER_VARIAB_EXPEC
source: Variable expected.
de: Variable erwartet.
es: Se esperaba Variable
fr: Variable attendue.
uk: Змінна очікується.

# Parser.ER_ONL_BYT_WORD
source: Only BYTE or WORD index is allowed in FOR.
de: In FOR-Schleifen sind nur BYTE oder WORD Indizes erlaubt.
es: Solo variables Byte o Word son permitidas.
fr: Seuls des indexes BYTE ou WORD sont autorisées dans une boucle FOR.
uk: Для FOR дозволено лише індекс BYTE або WORD.

# Parser.ER_ASIG_EXPECT
source: ":=" expected.
de: ":=" erwartet.
es: Se esperaba ":="
fr: ":=" attendu.
uk: ":=" очікується.

# Parser.ER_FIL_NOFOUND
source: File not found: %s
de: Datei nicht gefunden: "%s"
es: Archivo no encontrado: %s
fr: Fichier non trouvé: %s
uk: Файл не знайдено: %s

# Parser.WA_UNUSED_CON_
source: Unused constant: %s
de: Unbenutzte Konstante:%s
es: Constante sin usar: %s
fr: Constante non utilisée : %s
uk: Невикористана константа: %s

# Parser.WA_UNUSED_VAR_
source: Unused variable: %s
de: Unbenutzte Variable:%s
es: Variable sin usar: %s
fr: Variable non utilisée : %s
uk: Невикористана змінна: %s

# Parser.WA_UNUSED_PRO_
source: Unused procedure: %s
de: Unbenutztes Prozedur:%s
es: Procedimiento sin usar: %s
fr: Procédure non utilisée : %s
uk: Невикористана процедура: %s

# Parser.MSG_RAM_USED
source: RAM Used =
de: RAM verwendet =
es: RAM usada =
fr: RAM utilisée =
uk: RAM використано =

# Parser.MSG_FLS_USED
source: Flash Used =
de: Flash verwendet =
es: Flash usada=
fr: FLASH utilisée =
uk: Flash використано =

# FrameSyntaxTree.TIT_MAIN
source: Program
de: Programm
es: Programa
fr: Programme
uk: Програма

# FrameSyntaxTree.TIT_UNIT
source: Units
es: Unidades
fr: Unités
uk: Модулі

# FrameSyntaxTree.TIT_CONS
source: Constants
de: Konstanten
es: Constantes
fr: Constantes
uk: Константи

# FrameSyntaxTree.TIT_FUNC
source: Functions
de: Funktionen
es: Funciones
fr: Fonctions
uk: Функції

# FrameSyntaxTree.TIT_OTHER
source: Others
de: Anderes
es: Otros
fr: Autres
uk: Інше

# FrameSyntaxTree.Label1.Caption
source: Code Explorer
de: Quellenexplorer
es: Explorador de Código
fr: Explorateur de Code
uk: Оглядач коду

# FrameMessagesWin.MSG_INICOMP
source: Starting Compilation...
de: Compilieren ausführen...
es: Iniciando compilación...
fr: Lancement de la compilation....
uk: Починаю компіляцію...

# FrameMessagesWin.MSG_WARN
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
uk: Попередження

# FrameMessagesWin.MSG_WARNS
source: Warnings
de: Warnungen
es: Advertencias
fr: Avertissements
uk: Попередження

# FrameMessagesWin.MSG_ERRORS
source: Errors
de: Fehler
es: Errores
fr: Erreurs
uk: Помилки

# FrameMessagesWin.MSG_COMPIL
source: Compiled in:
de: Compiliert in:
es: Compilado en:
fr: Compilé en:
uk: Скомпільовано за:

# FrameMessagesWin.lblInform.Caption
source: Information
es: Información
uk: Інформація

# FrameMessagesWin.lblWarns.Caption
source: Warnings
de: Warnungen
es: Advertencias
fr: Avertissements
uk: Попередження

# FrameMessagesWin.lblErrors.Caption
source: Errors
de: Fehler
es: Errores
fr: Erreurs
uk: Помилки

# FrameMessagesWin.PanGrilla.Caption
source: << No messages >>
de: <<Keine Meldungen>>
es: << Sin mensajes >>
fr: << Aucun message >>
uk: << Немає повідомлень >>

# FrameEditView.MSG_NOFILES
source: No files
de: Keine Dateien
es: No hay archivos
fr: Aucun fichier
uk: Немає файлів

# FrameEditView.MSG_PASFILES
source: Pascal Files
de: Pascal Dateien
es: Archivos Pascal
fr: Fichiers Pascal
uk: Файли Pascal

# FrameEditView.MSG_ALLFILES
source: All files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
uk: Всі файли

# FrameEditView.MSG_MODIFSAV
source: File %s has been modified. Save?
de: Die Datei %s wurde verändert. Speichern ?
es: El archivo %s ha sido modificado. Guardar cambios?
fr: Le fichier %s a été modifié. Enregistrer?
uk: Файл %s було змінено. Зберегти?

# FrameEditView.MSG_NOSYNFIL
source: Syntax file not found: %s
de: Syntax-Datei nicht gefunden: %s
es: Archivo de sintaxis no encontrado: %s
fr: Fichier de syntaxe non trouvé : %s
uk: Файл синтаксиса не знайдено: %s

# FrameEditView.lblBackground.Caption
source: << No files >>
de: << Keine Dateien >>
es: << Sin archivos >>
fr: << Aucun fichier >>
uk: << Немає файлів >>

# FrameEditView.mnNewTab.Caption
source: New
de: Neu
es: Nuevo
fr: Nouveau
uk: Новий

# FrameEditView.mnCloseTab.Caption
source: Close
de: Schließen
es: Cerrar
fr: Fermer
uk: Закрити

# FrameEditView.mnCloseAll.Caption
source: Close All
de: Alle Schliessen
es: Cerrar todos
fr: Fermer Tout
uk: Закрити все

# FrameEditView.if mnRecents<>nil then mnRecents.Caption
source: &Recents
de: &Letzte
es: &Recientes

# FormPrincipal.mnFile.Caption
source: &File
de: &Datei
es: &Archivo
fr: &Fichier
uk: Файл

# FormPrincipal.mnEdit.Caption
source: &Edit
de: &Bearbeiten
es: &Edición
fr: &Editer
uk: Зміни

# FormPrincipal.mnFind.Caption
source: &Search
de: &Suchen
es: &Buscar
fr: &Chercher
uk: Пошук

# FormPrincipal.mnView.Caption
source: &View
de: &Anzeigen
es: &Ver
fr: &Affichage
uk: Вигляд

# FormPrincipal.mnTools.Caption
source: &Tools
es: &Herramientas
fr: &Outils
uk: Інструменти

# FormPrincipal.acArcNewProj.Caption
source: New &Project
de: Neues &Projekt
es: Nuevo &Proyecto
fr: Nouveau &Projet
uk: Новий проект

# FormPrincipal.acArcNewFile.Caption
source: New &File
de: &Neu
es: Nuevo &Archivo
fr: Nouveau &Fichier
uk: Новий файл

# FormPrincipal.acArcNewFile.Hint
source: New File
de: Neue Datei
es: Nuevo Archivo
fr: Nouveau Fichier
uk: Новий файл

# FormPrincipal.acArcNewProj.Hint
source: New &Project
de: Neues &Projekt
es: Nuevo Proyecto
fr: Nouveau &Projet
uk: Новий проект

# FormPrincipal.acArcOpen.Caption
source: &Open...
de: &Öffnen...
es: &Abrir...
fr: &Ouvrir...
uk: Відкрити...

# FormPrincipal.acArcOpen.Hint
source: Open file
de: Datei Öffnen
es: Abrir archivo
fr: Ouvrir un fichier
uk: Відкрити файл

# FormPrincipal.acArcSave.Caption
source: &Save
de: &Speichern
es: &Guardar
fr: &Enregistrer
uk: Зберегти

# FormPrincipal.acArcSave.Hint
source: Save file
de: Datei speichern
es: Guardar archivo
fr: Enregistrer fichier
uk: Зберегти файл

# FormPrincipal.acArcSaveAs.Caption
source: Sa&ve As...
de: Speichern &unter ...
es: G&uardar Como...
fr: Enregistrer &sous...
uk: Зберегти як...

# FormPrincipal.acArcSaveAs.Hint
source: Save file as...
de: Datei mit unter neuem Namen speichern ...
es: Guardar como...
fr: Enregistrer fichier sous...
uk: Зберегти файл як...

# FormPrincipal.acArcCloseFile.Caption
source: &Close File
de: Datei s&chließen
es: &Cerrar archivo
fr: &Fermer Fichier
uk: Закрити файл

# FormPrincipal.acArcCloseProj.Caption
source: Close Project
de: Projekt schließen
es: Cerrar Proyecto
fr: Fermer Projet
uk: Закрити проект

# FormPrincipal.mnSamples.Caption
source: Samples
de: Beispiele
es: Ejemplos
fr: Exemples
uk: Приклади

# FormPrincipal.acArcQuit.Caption
source: &Quit
de: &Beenden
es: &Salir
fr: &Quitter
uk: Вийти

# FormPrincipal.acArcQuit.Hint
source: Close the program
de: Programm beenden
es: Cerrar el programa
fr: Quitter l'application
uk: Закрити програму

# FormPrincipal.acEdUndo.Caption
source: &Undo
de: &Zurück
es: &Deshacer
fr: &Annuler
uk: Відміна

# FormPrincipal.acEdUndo.Hint
source: Undo
de: Änderung zurücknehmen
es: Deshacer
fr: Annuler
uk: Відміна

# FormPrincipal.acEdRedo.Caption
source: &Redo
de: &Wiederholen
es: &Rehacer
fr: &Refaire
uk: Повторити

# FormPrincipal.acEdRedo.Hint
source: Redo
de: Änderung wiederholen
es: Reahacer
fr: Refaire
uk: Повторити

# FormPrincipal.acEdCut.Caption
source: C&ut
de: A&usschneiden
es: Cor&tar
fr: Co&uper
uk: Вирізати

# FormPrincipal.acEdCut.Hint
source: Cut
de: Ausschneiden
es: Cortar
fr: Couper
uk: Вирізати

# FormPrincipal.acEdCopy.Caption
source: &Copy
de: &Kopieren
es: &Copiar
fr: Copier
uk: Копіювати

# FormPrincipal.acEdCopy.Hint
source: Copy
de: Kopieren
es: Copiar
fr: Copier
uk: Копіювати

# FormPrincipal.acEdPaste.Caption
source: &Paste
de: &Einfügen
es: &Pegar
fr: Co&ller
uk: Вставити

# FormPrincipal.acEdPaste.Hint
source: Paste
de: Einfügen
es: Pegar
fr: Coller
uk: Вставити

# FormPrincipal.acEdSelecAll.Caption
source: Select &All
de: Alles &Auswählen
es: Seleccionar &Todo
fr: Tout &Sélectionner
uk: Вибрати все

# FormPrincipal.acEdSelecAll.Hint
source: Select all
de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
uk: Вибрати все

# FormPrincipal.acBusFind.Caption
source: Search...
de: Suchen...
es: Buscar...

# FormPrincipal.acBusFind.Hint
source: Search text
de: Text suchen
es: Buscar texto

# FormPrincipal.acBusFindNxt.Caption
source: Search &Next
de: Weitersuche&n
es: Buscar &Siguiente

# FormPrincipal.acBusFindNxt.Hint
source: Search Next
de: Nächste Stelle suchen
es: Buscar Siguiente

# FormPrincipal.acBusReplac.Caption
source: &Replace...
de: &Ersetzen...
es: &Reemplazar...

# FormPrincipal.acBusReplac.Hint
source: Replace text
de: Text ersetzen
es: Reemplazar texto

# FormPrincipal.acViewMsgPan.Caption
source: &Messages Panel
de: &Nachrichten Panel
es: Panel de &Mensajes
fr: Panneau &Messages
uk: Панель повідомлень

# FormPrincipal.acViewMsgPan.Hint
source: Show/hide Messages Panel
de: Nachrichten Panel zeigen oder verbergen
es: Mostrar/Ocultar el Panel de Mensajes
fr: Montrer/Cacher le panneau des Messages
uk: Показати/Сховати панель повідомлень

# FormPrincipal.acViewStatbar.Caption
source: &Status Bar
de: &Statuszeile
es: Barra de &Estado
fr: Barre de &statut

# FormPrincipal.acViewStatbar.Hint
source: Show/hide Status Bar
de: Statuszeile zeigen oder verbergen
es: Mostrar/Ocultar la barra de estado
fr: Montrer/Cacher la barre de statut

# FormPrincipal.acViewToolbar.Caption
source: &Tool Bar
de: &Werkzeugleiste
es: Barra de &Herramientas
fr: Barre d'&Outils
uk: Панель інструментів

# FormPrincipal.acViewToolbar.Hint
source: Show/hide Tool Bar
de: Werkzeugleiste zeigen oder verbergen
es: Mostrar/Ocultar la barra de herramientas
fr: Montrer/Cacher la barre d'Outils
uk: Показати/Сховати панель інструментів

# FormPrincipal.acViewSynTree.Caption
source: &Code explorer
de: &Quelltext-Explorer
es: &Explorador de código.
fr: &Explorateur de Code
uk: Оглядач кода

# FormPrincipal.acToolCompil.Caption
source: &Compile
de: &Compilieren
es: &Compilar
fr: &Compiler
uk: Компілювати

# FormPrincipal.acToolCompil.Hint
source: Compile the source code
de: Compiliere den Quelltext
es: Compila el código fuente
fr: Compiler le code source
uk: Компілювати

# FormPrincipal.acToolComEjec.Caption
source: Compile and E&xecute
de: Compilieren und Au&sführen
es: Compilar y Ej&ecutar
fr: Compiler et &Exécuter
uk: Компілювати та виконати

# FormPrincipal.acToolComEjec.Hint
source: Compile and Execute
de: Compilieren und Ausführen
es: Compilar y Ejecutar
fr: Compiler et Exécuter
uk: Компілювати та виконати

# FormPrincipal.acToolPICExpl.Caption
source: PIC E&xplorer
es: E&xplorador de PIC
fr: E&xplorateur de PIC
uk: PIC оглядач

# FormPrincipal.acToolPICExpl.Hint
source: Open the PIC devices explorer
de: Öffne den PIC Geräte explorer
es: Abrir el explorador de dispos. PIC
fr: Ouvrir l'explorateur de modèles PIC
uk: Відкрити PIC оглядач

# FormPrincipal.acToolConfig.Caption
source: &Settings
de: &Einstellungen
es: Configuración
fr: &Paramètres
uk: Налагодження

# FormPrincipal.acToolConfig.Hint
source: Settings dialog
de: Einstellungs-Dialog
es: Ver configuración
fr: Paramètres
uk: Діалог налагоджень

# FormPrincipal.acToolFindDec.Caption
source: Find declaration
de: Finde Deklaration
es: Ir a la declaración
fr: Trouver déclaration
uk: Знайти декларування

# FormConfig.Caption
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
uk: Налаштування

# FormConfig.BitAceptar.Caption
source: &OK
es: Aceptar

# FormConfig.BitAplicar.Caption
source: &Apply
de: &Übernehmen
es: Aplicar
fr: &Appliquer
uk: Застосувати

# FormConfig.BitCancel.Caption
source: &Cancel
de: &Abbrechen
es: Cancelar
fr: A&nnuler
uk: Відміна

# FormConfig.RadioGroup1.Caption
source: Toolbar
de: Werkzeugleiste
es: Barra de herramientas
fr: Barre d’outils
uk: Панель інструментів

# FormConfig.RadioGroup1.Items[0]
source: Small Icons
de: Kleine Bilder
es: Íconos pequeños
fr: Petites Icônes
uk: Маленькі піктограми

# FormConfig.RadioGroup1.Items[1]
source: Big Icons
de: Große Bilder
es: Íconos grandes
fr: Grandes Icônes
uk: Великі піктограми

# FormConfig.label1.Caption
source: Units Path:
de: Unitpfad:
es: Ruta de unidades
fr: Répertoire des unités:

# FormConfig.chkAutSynChk.Caption
source: Automatic Syntax checking
de: Automatische Syntaxprüfung
es: Verificac. Automática de sintaxis
fr: Correction de syntaxe automatique
uk: Автомтична перевірка синтаксису
