Repository: joecare99/PicPas
Catalog: language/PicPas.*.po
Languages: de, es, fr, uk

# FormConfig.grpTabEdiState.Caption
source: Tab Editor State
de: Registerkarte Editor Zustand
es: Estado de pestañas del editor
fr: Affichage des onglets

# FormConfig.grpTabEdiState.Items[0]
source: &Show always
de: &Immer anzeigen
es: Mostrar &Siempre
fr: &Toujours afficher
uk: Показувати завжди

# FormConfig.grpTabEdiState.Items[1]
source: Hide for &One file
de: Ausblenden für &eine Datei
es: &Ocultar si hay un archivo
fr: &Si plusieurs fichiers
uk: Сховати для одного файлу

# FormConfig.grpTabEdiState.Items[2]
source: &Hide always
de: &Immer ausblenden
es: Ocultar &Siempre
fr: &Toujours cacher
uk: Ховати завжди

# FormConfig.Label2.Caption
source: Language
de: Sprache
es: Lenguaje
fr: Langue
uk: Мова

# FormConfig.tabEnviron.Caption
source: Environment
de: Umgebung
es: Entorno

# FormConfig.chkLoadLast.Caption
source: Load last file edited
de: Letzte editierte Datei laden
es: Cargar último archivo editado
fr: Charger le dernier
uk: Завантажити останній файл

# FormConfig.lblMessPan1.Caption
source: Message Panel Back color
de: Nachrichtenpaneel Hintergrundfarbe
es: Fondo del panel de mensajes

# FormConfig.lblMessPan2.Caption
source: Message Panel Text color:
de: Nachrichtenpaneel Textfarbe:
es: Texto del panel de mensajes

# FormConfig.lblMessPan3.Caption
source: Message Panel Error color:
de: Nachrichtenpaneel Fehlerfarbe:
es: Error del panel de mensajes

# FormConfig.lblMessPan4.Caption
source: Message Panel Selec. color:
de: Nachrichtenpaneel Auswahlfarbe:
es: Selec. del panel de mensajes

# FormConfig.lblPanelCol.Caption
source: Panels Color:
de: Paneelenfarbe:
es: Color de los paneles:
fr: Couleur des panneaux:
uk: Колір панелей:

# FormConfig.lblSplitterCol.Caption
source: Splitters color:
de: Trenner-Farbe:
es: Color de los separadores:

# FormConfig.lblCodExplCol1.Caption
source: Code Explorer Back color:
de: Code-Explorer Hintergrundfarbe:
es: Fondo del explor. de código:

# FormConfig.lblCodExplCol2.Caption
source: Code Explorer Text Color:
de: Code-Explorer Textfarbe:
es: Texto del explor. de código:

# FormConfig.butDefval.Caption
source: Set &Default Values
de: Setze &Standardwerte
es: Valores por &Defecto

# FormConfig.tabSyntax.Caption
source: Syntax
es: Sintaxis

# FormConfig.tabEnsamb.Caption
source: Assembler
es: Ensamblador

# FormConfig.chkIncHeadMpu.Caption
source: Include MPU &Header
de: MPU &Kopfzeilen einbinden
es: Incluir &Encabezado de MPU
fr: Inclure les directives de processeur
uk: Включити MPU заголовок

# FormConfig.chkIncDecVar.Caption
source: Include &Variables declaration
de: Variablendeklaration einfügen
es: Incluir Declaración de variables
fr: Inclure les déclarations de &variables
uk: Включити декларування змінних

# FormConfig.RadioGroup2.Caption
source: Style
de: Stil
es: Estilo
uk: Стиль

# FormConfig.chkExcUnused.Caption
source: Exclude unused
de: Unbenutzte ausschlieÃen
es: Excluir no usadas
fr: Exclure les portions inutilisées
uk: Виключити невикористовуване

# FormConfig.chkIncAddress.Caption
source: Include &Memory Address
de: Speicheradressen einbinden
es: Incluir &Dirección de memoria
fr: Inclure les adresses
uk: Включити Memory Address

# FormConfig.chkIncComment.Caption
source: Include &Comments
de: Kommentare hinzufügen
es: Incluir &Comentarios
fr: Inclure les
uk: Включити коментарі

# FormConfig.chkIncComment2.Caption
source: Include &Detailed comments
de: &Detaillierte Kommentare hinzufügen
es: Incluir Comentarios &detallados
fr: Inclure les commentaires
uk: Включити детальні коментарі

# FormConfig.chkIncVarName.Caption
source: Include &Variable Names
de: &Variablennamen einbinden
es: Incluir Nombre de &Variables
fr: Inclure les &noms de
uk: Включити імена змінних

# FormConfig.tabOutput.Caption
source: Compiler
es: Compilador

# FormConfig.chkShowErrMsg.Caption
source: &Show Error Messages
de: &Zeige Fehlermeldungen
es: &Mostrar mensajes de error
fr: &Afficher les messages d'erreur
uk: Показувати сповіщення про помилки

# FormConfig.grpOptimLev.Caption
source: Optimization Level:
de: Optimierungsstufe:
es: Nivel de optimización:
fr: Niveau d'optimisation:
uk: Рівень оптимізації:

# FormConfig.grpOptimLev.Items[0]
source: Fool
de: Dumm
es: Tonto
fr: Basique
uk: Дурень

# FormConfig.grpOptimLev.Items[1]
source: Smart
de: Schlau
es: Inteligente
fr: Avancé
uk: Розумний

# FormConfig.chkOptBnkAftIF.Caption
source: After IF structure
de: Nach IF-Struktur
es: Después de instrucciones IF.
fr: Après le bloc IF
uk: Після структури IF

# FormConfig.chkOptBnkBefPro.Caption
source: Before Procedures
de: Vor Prozeduren
es: Antes de procedimientos.
fr: Avant les procédures
uk: Перед процедурами

# FormConfig.chkOptBnkAftPro.Caption
source: After Procedures
de: Nach den Prozeduren
es: Después de procedimientos.
fr: Après les procédures
uk: Після адреси

# CfgSynEdit.Label6.Caption
source: &Font:
de: Schri&ftart:
es: &Letra:

# CfgSynEdit.Label7.Caption
source: &Size:
de: &Größe:
es: &Tamaño:

# CfgSynEdit.Label8.Caption
source: Back color:
de: Hintergrundfarbe:
es: Color de fondo:
fr: Fond
uk: Колір фону:

# CfgSynEdit.Label9.Caption
source: Font Color:
de: Schriftfarbe:
es: Color texto:
fr: Texte
uk: Колір шрифту:

# CfgSynEdit.chkViewVScroll.Caption
source: &Vertical Scrollbar
de: & Vertikale Bildlaufleiste
es: Barra de desplaz &Vert.

# CfgSynEdit.chkViewHScroll.Caption
source: &Horizontal Scrollbar
de: &Horizontale Bildlaufleiste
es: Barra de desplaz &Horiz.

# CfgSynEdit.chkAutoindent.Caption
source: Autoindent
de: Autom. Einrückung
es: Auto-indentado
fr: Indentation automatique

# CfgSynEdit.chkHighCurWord.Caption
source: Highlight current word
de: Aktuelles Wort markieren
es: Resaltar palabra bajo cursor

# CfgSynEdit.chkHighCurLin.Caption
source: Hightlight current line
de: Markiere aktuelle Zeile
es: Marcar línea actual

# CfgSynEdit.chkVerPanVer.Caption
source: Gutter
de: Rinne
es: Panel Vertical

# CfgSynEdit.chkVerNumLin.Caption
source: Show line number
de: Zeilennummer anzeigen
es: Ver Núm.de línea
fr: Numéros de ligne
uk: Показувати номер рядка

# CfgSynEdit.label2.Caption
source: Back color:
de: Hintergrundfarbe:
es: Color Fondo:
fr: Fond
uk: Колір фону:

# CfgSynEdit.chkVerMarPle.Caption
source: Show folding marks
de: Klappbare Marken zeigen
es: Ver Marc.de plegado
fr: Balises de
uk: Показувати згортаючі мітки

# CfgSynEdit.label3.Caption
source: Text color:
de: Farbe Text:
es: Color de texto:
fr: Texte
uk: Колір текста

# CfgExtTool.label1.Caption
source: Name:
es: Nombre:
fr: Nom:
uk: Імʼя

# CfgExtTool.label2.Caption
source: Program Path:
de: Programmpfad:
es: Ruta del programa:
fr: Répertoire de l'application:
uk: Шлях до програми:

# CfgExtTool.label3.Caption
source: Command line:
de: Befehlszeile:
es: Línea de comando:
fr: Ligne de commande:
uk: Командний рядок:

# CfgExtTool.label5.Caption
source: To reference the output *.hex file, use $(hexFile)
de: Um auf die Ausgabedatei *.hex zu verweisen, verwenden Sie $(hexFile)
es: Para referirse al archivo de salida, usar $(hexFile)
fr: $(hexFile) : insüre le fichier .hex
uk: Для посилання на вихідний *.hex файл, використовуй $(hexFile)

# CfgExtTool.label6.Caption
source: To reference the source file, use ${mainFile}
de: Um auf die Quelldatei zu verweisen, verwenden ${mainFile}
es: Para referirse al archivo fuente, usar $(mainFile)
fr: $(mainFile) : insère le fichier source
uk: Для посилання на файл сирця, use ${mainFile}

# CfgExtTool.label4.Caption
source: 16x16 icon:
de: 16x16 Symbol:
es: Ícono de 16x16:
uk: 16x16 піктограма:

# CfgExtTool.label7.Caption
source: 32x32 icon:
de: 32x32-Symbol:
es: Ícono de 32x32:
uk: 32x32 піктограма:

# CfgExtTool.chkWaitExit.Caption
source: &Wait on exit
de: &Warten auf den Ausgang
es: &Esperar a terminar
fr: &Attendre la fin de l'exécution

# CfgExtTool.chkShowTBar.Caption
source: &Show in Toolbar
de: &Anzeigen in der Symbolleiste
es: &Mostrar en la barra de Herram.
fr: &Montrer dans la barre d'outils
uk: Показувати в тулбарі

# CfgExtTool.butTest.Caption
source: &Test
es: &Probar
fr: &Tester
uk: Тест

# CfgExtTool.butAdd.Caption
source: &Add
de: &Fügen
es: &Agregar
fr: &Ajouter
uk: Додати

# CfgExtTool.butRemove.Caption
source: &Remove
de: &Entfernen
es: &Eliminar
fr: &Supprimer
uk: Видалити

# CfgExtTool.ER_FAIL_EXEC_
source: Fail executing: %s
de: Fehler bei Ausführung: %s
es: Falla ejecutando: %s
fr: Erreur d'exécution: %s
uk: Невдале виконання: %s

# CfgExtTool.PRE_TOOL_NAME
source: Tool
de: Werkzeug
es: Herramienta
fr: Outil
uk: Інструмент

# CfgExtTool.ER_ICO_FIL_UNEXIS_
source: Icon file doesn't exist: %s
de: Symboldatei ist nicht vorhanden: %s
es: No existe el archivo de ícono: %s

# CfgExtTool.ER_BOTH_ICO_SPEC
source: Both icon files must be specified.
de: Beide Symboldateien müssen angegeben werden.
es: Se debe especificar ambos íconos.

# CfgSynEdit.label10.Caption
source: Back color:
de: Hintergrundfarbe:
es: Color de fondo:
fr: Fond
uk: Колір фону:

# CfgSynEdit.label11.Caption
source: Text color:
de: Farbe Text:
es: Color de texto:
fr: Texte
uk: Колір текста

# CfgSynEdit.label12.Caption
source: Frame color:
de: Rahmenfarbe:
es: Color de borde:
fr: Cadre
uk: Колір рамки:

# CfgSynEdit.chkFullWord.Caption
source: Full Word
de: Ganzes Wort
es: Palabra completa
fr: Mot complet
uk: Повне слово

# CompBase.ER_IDEN_EXPECT
source: Identifier expected.
de: Bezeichner erwartet.
es: Identificador esperado.
fr: Identifiant attendu.
uk: Очікується ідентифікатор.

# CompBase.ER_NOT_IMPLEM_
source: Not implemented: "%s"
de: Nicht implementiert: "%s"
es: No implementado: "%s"
fr: Non implémenté : "%s"
uk: Не впроваджено: "%s"

# CompBase.ER_DUPLIC_IDEN
source: Duplicated identifier: "%s"
de: Doppelter Platzhalter: "%s"
es: Identificador duplicado: "%s"
fr: Identifiant à double : "%s"
uk: Дубльований ідентифікатор: "%s"

# CompBase.ER_UNDEF_TYPE_
source: Undefined type "%s"
de: Undefinierter Typ "%s"
es: Tipo "%s" no definido.
fr: Type indéfini "%s"
uk: Невизначений тип "%s"

# CompBase.ER_SEMIC_EXPEC
source: ";" expected.
de: "," erwartet.
es: Se esperaba ";"
uk: ";" очікувалося.

# CompBase.ER_STR_EXPECTED
source: "%s" expected.
de: "%s" erwartet.
es: Se esperaba "%s"
uk: "%s" очікується.

# CompBase.ER_TYP_PARM_ER_
source: Type parameters error on %s
de: Typparameterfehler auf %s
es: Error en tipo de parámetros de %s

# CompBase.ER_UNKNOWN_IDE_
source: Unknown identifier: %s
de: Unbekannter Bezeichner: %s
es: Identificador desconocido: %s
fr: Identifiant inconnu : <ph id="mtc_1" equiv-text="base64:JXM="/>

# CompBase.ER_IN_EXPRESSI
source: Error in expression. ")" expected.
de: Fehler im Ausdruck. ")" erwartet.
es: Error en expresión. Se esperaba ")"

# CompBase.ER_OPERAN_EXPEC
source: Operand expected.
de: Operand erwartet.
es: Se esperaba operando.
uk: Операнд очікував.

# CompBase.ER_ILLEG_OPERA_
source: Illegal Operation: %s
de: Unzulässiger Vorgang: %s
es: Operación no válida: %s

# CompBase.ER_UND_OPER_TY_
source: Undefined operator: %s for type: %s
de: Nicht definierter Operator: %s für Typ: %s
es: No está definido el operador: %s para tipo: %s

# CompBase.ER_CAN_AP_OPER_
source: Cannot apply the operator "%s" to type "%s"
de: Der Operator "%s" kann nicht auf den Typ "%s" angewendet werden.
es: No se puede aplicar el operador "%s" al tipo "%s"

# CompBase.ER_IN_CHARACTER
source: Error in character.
de: Fehler im Zeichen.
es: Error en caracter.

# CompBase.ER_INV_COD_CHAR
source: Invalid code for char.
de: Ungültiger Code für Zeichen.
es: Código inválido para caracter

# CompBase.ER_IDE_TYP_EXP
source: Identifier of type expected.
de: Typenbezeichner erwartet.
es: Se esperaba identificador de tipo.
fr: Identifiant de type attendu.
uk: Очікується ідентифікатор типу.

# CompBase.ER_ONLY_ONE_REG
source: Only one REGISTER parameter is allowed.
de: Nur ein REGISTER Parameter erlaubt.
es: Solo se permite un parámetro REGISTER.
fr: Un seul paramètre REGISTRE est autorisé.
uk: Дозволено тільки один параметр REGISTER.

# CompBase.ER_RA_HAV_USED
source: Register A has been used.
de: Register A wurde verwendet.
es: Ya se ha usado el rgistro A.

# Compiler.ER_NOT_IMPLEM_
source: Not implemented: "%s"
de: Nicht implementiert: "%s"
es: No implementado: "%s"
fr: Non implémenté : "%s"
uk: Не впроваджено: "%s"

# Compiler.ER_IDEN_EXPECT
source: Identifier expected.
de: Bezeichner erwartet.
es: Identificador esperado.
fr: Identifiant attendu.
uk: Очікується ідентифікатор.

# Compiler.ER_DUPLIC_IDEN
source: Duplicated identifier: "%s"
de: Doppelter Platzhalter: "%s"
es: Identificador duplicado: "%s"
fr: Identifiant à double : "%s"
uk: Дубльований ідентифікатор: "%s"

# Compiler.ER_INVAL_FLOAT
source: Unvalid float number.
de: Ungültige Gleitkommazahl.
es: Número decimal no válido.
fr: Nombre à virgule flottante invalide.
uk: Невірне число з плаваючою комою.

# Compiler.ER_NOTYPDEFNUM
source: No type defined to accommodate this number.
de: Kein Typ definiert.
es: No hay tipo definido para albergar a este número.
fr: Aucun type défini pour ce nombre.
uk: Для типу цього числа не визначено жодного типу

# Compiler.ER_INV_MEMADDR
source: Invalid memory address.
de: Ungültige Speicheradresse.
es: Dirección de memoria inválida.
fr: Adresse mémoire invalide.
uk: Недійсна адреса памʼяті.

# Compiler.ER_BIT_VAR_REF
source: A bit variable reference expected.
de: Es wird eine Bitvariablen-referenz erwartet.
es: Se esreraba referencia a una variable bit.
fr: Référence de bit attendue.
uk: Очікується біт-змінна.

# Compiler.ER_EXP_VAR_IDE
source: Identifier of variable expected.
de: Variablenbezeichner erwartet.
es: Se esperaba identificador de variable.
fr: Identifiant de variable attendu.
uk: Очікується фдентифікатор змінної.

# Compiler.ER_UNKNOWN_ID_
source: Unknown identifier: %s
de: Unbekannter Bezeichner: %s
es: Identificador desconocido: %s
fr: Identifiant inconnu : %s
uk: Невідомий ідентифікатор: %s

# Compiler.ER_IDE_CON_EXP
source: Identifier of constant expected.
de: Konstantenbezeichner erwartet.
es: Se esperaba identificador de constante
fr: Identifiant de constante attendu
uk: Очікується ідентифікатор константи.

# Compiler.ER_NUM_ADD_EXP
source: Numeric address expected.
de: Numerische Adresse erwartet.
es: Se esperaba dirección numérica.
fr: Adresse numérique attendue.
uk: Очікується числова адреса.

# Compiler.ER_IDE_TYP_EXP
source: Identifier of type expected.
de: Typenbezeichner erwartet.
es: Se esperaba identificador de tipo.
fr: Identifiant de type attendu.
uk: Очікується ідентифікатор типу.

# Compiler.ER_SEM_COM_EXP
source: ":" or "," expected.
de: ":"oder"," erwartet.
es: Se esperaba ":" o ",".
fr: ":" ou "," attendus.
uk: ":" або "," очікується.

# Compiler.ER_EQU_COM_EXP
source: "=" or "," expected.
de: "=" oder "," erwartet.
es: Se esperaba "=" o ","
fr: "=" ou "," attendus.
uk: "=" або "," очікується.

# Compiler.ER_COMPIL_PROC
source: There is a compilation in progress.
de: Es ist (noch) ein Kompiliervorgang aktiv.
es: Ya se está compilando un programa actualmente.
fr: Une compilation et en cours.
uk: Триває компіляція.

# Compiler.ER_CON_EXP_EXP
source: Constant expression expected.
de: Konstanter Ausdruck erwartet.
es: Se esperaba una expresión constante
fr: Expression constante attendue.

# Compiler.ER_FIL_NOFOUND
source: File not found: %s
de: Datei nicht gefunden: "%s"
es: Archivo no encontrado: %s
fr: Fichier non trouvé: %s
uk: Файл не знайдено: %s

# Compiler.WA_UNUSED_CON_
source: Unused constant: %s
de: Unbenutzte Konstante:%s
es: Constante sin usar: %s
fr: Constante non utilisée : %s
uk: Невикористана константа: %s

# Compiler.WA_UNUSED_VAR_
source: Unused variable: %s
de: Unbenutzte Variable:%s
es: Variable sin usar: %s
fr: Variable non utilisée : %s
uk: Невикористана змінна: %s

# Compiler.WA_UNUSED_PRO_
source: Unused procedure: %s
de: Unbenutztes Prozedur:%s
es: Procedimiento sin usar: %s
fr: Procédure non utilisée : %s
uk: Невикористана процедура: %s

# Compiler.MSG_RAM_USED
source: RAM Used =
de: RAM verwendet =
es: RAM usada =
fr: RAM utilisée =
uk: RAM використано =

# Compiler.MSG_FLS_USED
source: Flash Used =
de: Flash verwendet =
es: Flash usada=
fr: FLASH utilisée =
uk: Flash використано =

# Compiler.ER_ARR_SIZ_BIG
source: Array size to big.
de: Arraygröße zu groß.
es: Tamaño de arreglo muy grande
fr: Tableau trop grand.
uk: Розмір масиву завеликий.

# Compiler.ER_INV_ARR_SIZ
source: Invalid array size.
de: Ungültige Arraygröße.
es: Tamaño de arreglo inválido
fr: Taille de tableau invalide.
uk: Помилка в розмірі масиву.

# CompMain.ER_INV_MEMADDR
source: Invalid memory address.
de: Ungültige Speicheradresse.
es: Dirección de memoria inválida.
fr: Adresse mémoire invalide.
uk: Недійсна адреса памʼяті.

# CompMain.ER_EXP_VAR_IDE
source: Identifier of variable expected.
de: Variablenbezeichner erwartet.
es: Se esperaba identificador de variable.
fr: Identifiant de variable attendu.
uk: Очікується фдентифікатор змінної.

# CompMain.ER_NUM_ADD_EXP
source: Numeric address expected.
de: Numerische Adresse erwartet.
es: Se esperaba dirección numérica.
fr: Adresse numérique attendue.
uk: Очікується числова адреса.

# CompMain.ER_CON_EXP_EXP
source: Constant expression expected.
de: Konstanter Ausdruck erwartet.
es: Se esperaba una expresión constante
fr: Expression constante attendue.

# CompMain.ER_EQU_EXPECTD
source: "=" expected.
de: "=" erwartet.
es: Se esperaba "="
fr: "=" attendue.
uk: "=" очікується.

# CompMain.ER_IDEN_EXPECT
source: Identifier expected.
de: Bezeichner erwartet.
es: Identificador esperado.
fr: Identifiant attendu.
uk: Очікується ідентифікатор.

# CompMain.ER_NOT_IMPLEM_
source: Not implemented: "%s"
de: Nicht implementiert: "%s"
es: No implementado: "%s"
fr: Non implémenté : "%s"
uk: Не впроваджено: "%s"

# CompMain.ER_SEM_COM_EXP
source: ":" or "," expected.
de: ":"oder"," erwartet.
es: Se esperaba ":" o ",".
fr: ":" ou "," attendus.
uk: ":" або "," очікується.

# CompMain.ER_INV_ARR_SIZ
source: Invalid array size.
de: Ungültige Arraygröße.
es: Tamaño de arreglo inválido
fr: Taille de tableau invalide.
uk: Помилка в розмірі масиву.

# CompMain.ER_ARR_SIZ_BIG
source: Array size to big.
de: Arraygröße zu groß.
es: Tamaño de arreglo muy grande
fr: Tableau trop grand.
uk: Розмір масиву завеликий.

# CompMain.ER_IDE_TYP_EXP
source: Identifier of type expected.
de: Typenbezeichner erwartet.
es: Se esperaba identificador de tipo.
fr: Identifiant de type attendu.
uk: Очікується ідентифікатор типу.

# CompMain.ER_IDE_CON_EXP
source: Identifier of constant expected.
de: Konstantenbezeichner erwartet.
es: Se esperaba identificador de constante
fr: Identifiant de constante attendu
uk: Очікується ідентифікатор константи.

# CompMain.ER_EQU_COM_EXP
source: "=" or "," expected.
de: "=" oder "," erwartet.
es: Se esperaba "=" o ","
fr: "=" ou "," attendus.
uk: "=" або "," очікується.

# CompMain.ER_DUPLIC_IDEN
source: Duplicated identifier: "%s"
de: Doppelter Platzhalter: "%s"
es: Identificador duplicado: "%s"
fr: Identifiant à double : "%s"
uk: Дубльований ідентифікатор: "%s"

# CompMain.ER_NOTYPDEF_NU
source: No type defined to allocate this number.
de: Es wurde kein Typ definiert, um diese Nummer zuzuweisen.
es: No hay tipo para almacenar este número.
fr: Aucun type défini pour allouer ce nombre
uk: Не визначено тип, щоб виділити цей номер.

# CompMain.ER_EOF_END_EXP
source: Unexpected end of file. "end" expected.
de: Unerwartetes Dateiende. "end" erwartet.
es: Inesperado fin de archivo. Se esperaba "end".
fr: "end" attendu à la fin du fichier.
uk: Неочікуваний кінець файла. "end" очікується.

# CompMain.ER_ELS_UNEXPEC
source: "else" unexpected.
de: "else" nicht erwartet.
es: "else" inesperado
fr: "else" inattendu.
uk: "else" несподівано.

# CompMain.ER_END_EXPECTE
source: "end" expected.
de: "End" erwartet.
es: Se esperaba "end".
fr: "end" attendu.
uk: "end" очікується.

# CompMain.ER_NOT_AFT_END
source: Syntax error. Nothing should be after "END."
de: Syntax-Fehler. Es sollte nichts nach "END." kommen.
es: Error de sintaxis. Nada debe aparecer después de "END."
fr: Erreur de syntaxe. Rien ne devrait suivre "END."
uk: Синтаксична помилка. Нічого не повинно бути після "END."

# CompMain.ER_ONLY_ONE_REG
source: Only one REGISTER parameter is allowed.
de: Nur ein REGISTER Parameter erlaubt.
es: Solo se permite un parámetro REGISTER.
fr: Un seul paramètre REGISTRE est autorisé.
uk: Дозволено тільки один параметр REGISTER.

# CompMain.ER_BOOL_EXPECT
source: Boolean expression expected.
de: Bool'scher Ausdruck erwartet.
es: Se esperaba expresión booleana.
fr: Expression booléenne attendue
uk: Очікується булевий вираз.

# CompMain.ER_INST_NEV_EXE
source: Instruction will never execute.
de: Bereich wird niemals ausgeführt.
es: Esta instrucción no se ejecutará
fr: L'instruction ne sera jamais exécutée.
uk: Інструкція ніколи не виконуватиметься.

# CompMain.ER_UNKN_STRUCT
source: Unknown structure.
de: Unbekannte Struktur.
es: Estructura desconocida.
fr: Structure inconnue.
uk: Невідома структура.

# CompMain.ER_ERR_IN_NUMB
source: Error in number.
de: Fehler bei Nummer.
es: Error en número
fr: Nombre invalide.
uk: Помилка в числі.

# CompMain.ER_UNDEF_TYPE_
source: Undefined type "%s"
de: Undefinierter Typ "%s"
es: Tipo "%s" no definido.
fr: Type indéfini "%s"
uk: Невизначений тип "%s"

# CompMain.ER_DUPLIC_FUNC_
source: Duplicated function: %s
de: Duplizierte Funktion: %s
es: Función duplicada: %s

# CompMain.ER_FIL_NOFOUND
source: File not found: %s
de: Datei nicht gefunden: "%s"
es: Archivo no encontrado: %s
fr: Fichier non trouvé: %s
uk: Файл не знайдено: %s

# CompMain.ER_PROG_NAM_EX
source: Program name expected.
de: Name des Programms erwartet.
es: Se esperaba nombre de programa.
fr: Nom de programme attendu.
uk: Очікується імʼя програми.

# FormConfig.TIT_CFG_ENVIRON
source: Environment
de: Umgebung
es: Entorno
fr: Environnement
uk: Оточення

# FormConfig.label3.Caption
source: &Set Theme
de: &Wähle Design
es: &Fijar Tema
fr: &Charger un thème
uk: Обрати тему

# FormConfig.LABEL_THEM_NONE
source: None
de: Keine
es: Ninguno
fr: Aucun
uk: Нічого

# FormConfig.label4.Caption
source: &Create Theme
de: &Design erstellen
es: &Crear Tema
fr: &Créer un thème
uk: Створити тему

# FormConfig.butSaveCurThem.Caption
source: &Save current config.
de: &Aktuelle Konfiguration speichern.
es: Guardar config. actual
fr: &Enregister thème actuel
uk: Зберегти налаштування

# FormConfig.lblSplitCol.Caption
source: Splitters color:
de: Trenner-Farbe:
es: Color de los separadores:
fr: Couleur des séparateurs:
uk: Колір розподілувача:

# FormConfig.TIT_CFG_CODEXP
source: Code Explorer
de: Quellenexplorer
es: Explorador de Código
fr: Explorateur de Code
uk: Оглядач коду

# FormConfig.grpFilType.Caption
source: File types shown:
de: Gezeigte Dateitypen:
es: Tipos de archivos mostrados:
fr: Types de fichiers affichés:

# FormConfig.TIT_CFG_MESPAN
source: Message Panel
de: Nachrichtenbereich
es: Panel de Mensajes
fr: Panneau de Messages
uk: Панель повідомлень

# FormConfig.Label6.Caption
source: &Font:
de: Schri&ftart:
es: &Letra:
fr: Police
uk: Шрифт:

# FormConfig.Label7.Caption
source: &Size:
de: &Größe:
es: &Tamaño:
fr: Taille
uk: Розмір:

# FormConfig.chkViewVScroll.Caption
source: &Vertical Scrollbar
de: & Vertikale Bildlaufleiste
es: Barra de desplaz &Vert.
fr: Barre de défilement
uk: Вертикальній скролбар

# FormConfig.chkViewHScroll.Caption
source: &Horizontal Scrollbar
de: &Horizontale Bildlaufleiste
es: Barra de desplaz &Horiz.
fr: Barre de défilement
uk: Горизонтальний скролбар

# FormConfig.TIT_CFG_EDICOL
source: Colors
de: Farben
es: Colores
fr: Couleurs
uk: Кольори

# FormConfig.TIT_CFG_SYNTAX
source: Syntax
es: Sintaxis
fr: Syntaxe
uk: Синтакс

# FormConfig.TIT_CFG_ASSEMB
source: Assembler
es: Ensamblador
fr: Assembleur
uk: Асемблер

# FormConfig.TIT_CFG_COMPIL
source: Compiler
es: Compilador
fr: Compilateur
uk: Компілятор
