Repository: joecare99/PicPas
Catalog: language/PicPas.*.po
Languages: de, es, fr, uk

# FormConfig.chkReuProcVar.Caption
source: Reuse Procedures Variables
de: Prozedurvariablen wiederverwenden
es: Reutilizar variables de proced.
fr: Ré-utiliser les variables de procédure
uk: Повторно використовувати змінні процедур

# FormConfig.TIT_CFG_EXTOOL
source: External Tool
de: Externes Werkzeug
es: Herramienta Externa
fr: Outils Externes
uk: Завнішній інструмент

# FormPrincipal.acSearFind.Caption
source: Find...
de: Finden...
es: Buscar...
fr: Chercher...
uk: Знайти...

# FormPrincipal.acSearFind.Hint
source: Find text
de: Finde Text
es: Buscar texto
fr: Chercher texte
uk: Знайти текст

# FormPrincipal.acSearFindNxt.Caption
source: Find &Next
de: &Weitersuchen
es: Buscar &Siguiente
fr: Chercher &Suivant
uk: Знайти наступний

# FormPrincipal.acSearFindNxt.Hint
source: Find Next
de: Weitersuchen
es: Buscar Siguiente
fr: Chercher Suivant
uk: Знайти наступний

# FormPrincipal.acSearFindPrv.Caption
source: Find &Previous
de: Finde &Vorherige
es: Buscar &Anterior
fr: Chercher &Précédent
uk: Знайти попередній

# FormPrincipal.acSearFindPrv.Hint
source: Find &Previous
de: Finde &Vorherige
es: Buscar &Anterior
fr: Chercher Précédent
uk: Знайти попередній

# FormPrincipal.acSearReplac.Caption
source: &Replace...
de: &Ersetzen...
es: &Reemplazar...
fr: &Remplacer...
uk: Замінити...

# FormPrincipal.acSearReplac.Hint
source: Replace text
de: Text ersetzen
es: Reemplazar texto
fr: Remplacer texte
uk: Замінити текст

# FormPrincipal.acViewAsmPan.Caption
source: &Assembler Panel
de: &Assembler Bereich
es: &Panel de ensamblador.
fr: Panneau &Assembleur
uk: Панель асемблера

# FormPrincipal.acToolListRep.Caption
source: &List Report
de: &List-Bericht
es: &Reporte de listado
fr: &Rapport de Compilation
uk: Звіт

# FormPrincipal.acToolRamExp.Caption
source: &RAM Explorer
es: Explorador de &RAM
uk: &Провідник оперативної пам'яті

# FormPrincipal.acToolASMDebug.Caption
source: ASM &Debugger
es: &Depurador de ASM
fr: &Débogueur PIC
uk: ASM зневаджувач

# FormPrincipal.acToolASMDebug.Hint
source: ASM &Debugger
es: &Depurador de ASM
fr: Démarrer le Débogueur
uk: ASM зневаджувач

# FormPrincipal.MenuItem51.Caption
source: &Select Compiler
es: &Elegir Compilador

# FormPrincipal.MSG_MODIFIED
source: (*)Modified
de: (*) Geändert
es: (*)Modificado
fr: (*)Modifié
uk: (*)Змінено

# FormPrincipal.MSG_SAVED
source: Saved
de: Gespeichert
es: Guardado
fr: Enregistré
uk: Збережено

# FormPrincipal.MSG_NOFILES
source: No files.
de: Keine Dateien
es: Sin archivos
fr: Aucun fichier
uk: Немає файлів.

# FormPrincipal.MSG_NOFOUND_
source: No found "%s"
de: "%s" nicht gefunden
es: No se encuentra: "%s"
fr: "%s" non trouvé
uk: Не знайдено "%s"

# FormPrincipal.MSG_N_REPLAC
source: %d words replaced
de: %d Wörter ersetzt
es: Se reemplazaron %d ocurrencias.
fr: %d mots remplacés
uk: %d слів замінено

# FormPrincipal.MSG_REPTHIS
source: Replace this?
de: Ersetzen
es: ¿Reemplazar esta ocurrencia?
fr: Remplacer ceci?
uk: Замінити це?

# FormPrincipal.MSG_SYNFIL_NOF
source: Syntax file not found: %s
de: Syntax-Datei nicht gefunden: %s
es: Archivo de sintaxis no encontrado: %s
fr: Fichier de syntaxe non trouvé : %s

# FormPrincipal.MSG_FILSAVCOMP
source: File must be saved before compiling.
de: Die Datei muss vor dem Kompilieren gespeichert werden.
es: Archivo debe ser guardado antes de compilar
fr: Le fichier doit être sauvegardé pour compiler.

# FormPrincipal.MSG_BASEL_COMP
source: Baseline Compiler
es: Compilador Baseline

# FormPrincipal.MSG_MIDRAN_COMP
source: Mid-range Compiler
es: Compilador Mid-range

# FormPrincipal.MSG_ENMIDR_COMP
source: Enhanced Mid-range Compiler
de: Verbesserter Midrange-Compiler
es: Compilador Enhanced Mid-range

# FrameArcExplor.NEW_FILE_NAME
source: newfile.pas
de: neue_datei.pas
es: nuevo.pas
fr: nouveau.pas

# FrameArcExplor.FOLDER_NAME
source: folder
de: Ordner
es: carpeta
fr: répertoire
uk: папки

# FrameArcExplor.TXT_EMPTY
source: <empty>
de: <leer>
es: <vacía>
fr: <vide>

# FrameArcExplor.TXT_FOLD
source: C&ollapse
de: Ein&klappen
es: Con&traer
fr: &Réduire

# FrameArcExplor.TXT_UNFOLD
source: E&xpand
de: E&xpandieren
es: E&xpandir
fr: &Développer

# FrameArcExplor.TXT_NOTDELFOL
source: Cannot delete folders
de: Ordner können nicht gelöscht werden
es: No se puede eliminar carpetas.
fr: Impossible de supprimer les répertoires

# FrameArcExplor.TXT_DELFILE
source: Delete file "%s"?
de: Datei "%s" löschen?
es: ¿Eliminar archivo "%s"?
fr: Supprimer fichier "%s" ?

# FrameArcExplor.mnFolOpenInExplor.Caption
source: Open on &Windows Explorer
de: Öffnen mit &Windows Explorer
es: Abrir en Explor. de &Windows
fr: Ouvrir dans l'Explorateur &Windows
uk: Відкрити у провіднику Windows

# FrameArcExplor.mnFolNewFile.Caption
source: &New File
de: &Neu
es: &Nuevo Archivo
fr: &Nouveau Fichier
uk: &Новий файл

# FrameArcExplor.mnFolNewFolder.Caption
source: New &Folder
de: Neu &Ordner
es: Nueva &Carpeta
fr: Nouveau &Répertoire
uk: Створити &Теку

# FrameArcExplor.mnFolChanName.Caption
source: Cha&nge Name
de: Name Ä&ndern
es: Ca&mbiar Nombre
fr: &Renommer

# FrameArcExplor.mnFolDelete.Caption
source: &Delete
de: &Löschen
es: El&iminar
fr: &Supprimer
uk: &Вилучити

# FrameArcExplor.mnFolRefresh.Caption
source: &Refresh
de: &Aktualisieren
es: &Refrescar
fr: &Rafraîchir

# FrameArcExplor.mnFilOpen.Caption
source: &Open
de: Öffnen
es: &Abrir
fr: &Ouvrir
uk: &Відкрити

# FrameArcExplor.mnFilChanName.Caption
source: Cha&nge Name
de: Name Ä&ndern
es: Ca&mbiar Nombre
fr: &Renommer

# FrameArcExplor.mnFilCreCopFrom.Caption
source: Create Co&py from
de: Erstelle Ko&pie von
es: Crear &Copia de

# FrameArcExplor.mnFilDelete.Caption
source: &Delete
de: &Löschen
es: El&iminar
fr: &Supprimer
uk: &Вилучити

# FrameArcExplor.mnFilRefrescar.Caption
source: &Refresh
de: &Aktualisieren
es: &Refrescar
fr: &Rafraîchir

# FrameEditView.mnCloseOthers.Caption
source: Close &others
de: Schließe &andere
es: Cerrar &otros
fr: Fermer &Autres
uk: Закрити інші

# FrameEditView.mnRecents.Caption
source: &Recents
de: &Letzte
es: &Recientes
fr: &Récents
uk: Нещодавні

# FrameMessagesWin.mnClearAll.Caption
source: Clear &All
de: Alle lös&chen
es: Limpiar &Todo
fr: Effacer &Tout
uk: Зтерти все

# FrameMessagesWin.mnCopyRow.Caption
source: &Copy Row
de: Zeile &kopiere
es: &Copiar fila
fr: &Copier ligne

# FrameSyntaxTree.TIT_TYPE
source: Types
de: Typen
es: Tipos
uk: Типи

# GenCod.MSG_NOT_IMPLEM
source: Not implemented.
de: Nicht umgesetzt.
es: No implementado
fr: Non implémenté.

# GenCod.MSG_INVAL_PARTYP
source: Invalid parameter type: %s
de: Ungültiger Parametertyp: %s
es: Tipo de parámetro inválido: %s
fr: Type de paramètre invalide: %s

# GenCod.MSG_UNSUPPORTED
source: Unsupported
de: Nicht unterstützt
es: No soportado
fr: Non supporté

# GenCod.MSG_CANNOT_COMPL
source: Cannot Compile: "%s"
de: Kompilieren: "%s" kann nicht kompiliert werden
es: No se puede compilar: %s
fr: Non compilable: "%s"

# GenCod.ER_INV_MEMADDR
source: Invalid memory address.
de: Ungültige Speicheradresse.
es: Dirección de memoria inválida.
fr: Adresse mémoire invalide.
uk: Недійсна адреса памʼяті.

# GenCod.ER_INV_MAD_DEV
source: Invalid memory address for this device.
de: Ungültige Speicheradresse für dieses Gerät.
es: No existe esta dirección de memoria en este dispositivo.
uk: Недійсна адреса памʼяті для цього пристрою.

# GenCodBas.TXT_SAVE_W
source: ;save W
de: ;W speichern
es: ;guardar W
fr: ;sauvegarder W
uk: ;зберегти W

# GenCodBas.TXT_SAVE_Z
source: ;save Z
de: ;Z speichern
es: ;guardar Z
fr: ;sauvegarder Z
uk: ;зберегти Z

# GenCodBas.TXT_SAVE_H
source: ;save H
de: ;H speichern
es: ;guardar H
fr: ;sauvegarder H
uk: ;зберегти H

# GenCodBas.MSG_NO_ENOU_RAM
source: No enough RAM
de: Nicht genug RAM-Speicher
es: No hay suficiente RAM.
fr: Mémoire insuffisante

# GenCodBas.MSG_VER_CMP_EXP
source: Very complex expression. To simplify.
de: Sehr komplexer Ausdruck. Zur Vereinfachung.
es: Expresión muy compleja. Simplificar.
fr: Expression trop complexe. À simplifier.

# GenCodBas.MSG_STACK_OVERF
source: Stack Overflow
es: Desborde de pila.
fr: Débordement de pile.

# GenCodBas.MSG_NOT_IMPLEM
source: Not implemented.
de: Nicht umgesetzt.
es: No implementado
fr: Non implémenté.

# GenCodBas.ER_VARIAB_EXPEC
source: Variable expected.
de: Variable erwartet.
es: Se esperaba Variable
fr: Variable attendue.
uk: Змінна очікується.

# GenCodBas.ER_ONL_BYT_WORD
source: Only BYTE or WORD index is allowed in FOR.
de: In FOR-Schleifen sind nur BYTE oder WORD Indizes erlaubt.
es: Solo variables Byte o Word son permitidas.
fr: Seuls des indexes BYTE ou WORD sont autorisées dans une boucle FOR.
uk: Для FOR дозволено лише індекс BYTE або WORD.

# GenCodBas.ER_ASIG_EXPECT
source: ":=" expected.
de: ":=" erwartet.
es: Se esperaba ":="
fr: ":=" attendu.
uk: ":=" очікується.

# Parser.ER_NOTYPDEF_NU
source: No type defined to allocate this number.
de: Es wurde kein Typ definiert, um diese Nummer zuzuweisen.
es: No hay tipo para almacenar este número.
fr: Aucun type défini pour allouer ce nombre
uk: Не визначено тип, щоб виділити цей номер.

# Parser.ER_ARR_SIZ_BIG
source: Array size to big.
de: Arraygröße zu groß.
es: Tamaño de arreglo muy grande
fr: Tableau trop grand.
uk: Розмір масиву завеликий.

# Parser.ER_INV_ARR_SIZ
source: Invalid array size.
de: Ungültige Arraygröße.
es: Tamaño de arreglo inválido
fr: Taille de tableau invalide.
uk: Помилка в розмірі масиву.

# ParserDirec.ER_TOOHIGHFRE
source: Frequency too high for this device.
de: Frequenz zu hoch für dieses Gerät.
es: Frecuencia muy alta para este microproc.
fr: Fréquence trop élevée pour ce modèle.
uk: Частота зависока для цього приладу.

# ParserDirec.ER_EXPECTED_BR
source: Expected: "}".
de: ":=" erwartet.
es: Se esperaba "}".
fr: Attendu: "}"
uk: Очікується: "}".

# ParserDirec.ER_ENDIF_NOFOU
source: "$ENDIF" not found.
de: "$ENDIF" nicht gefunden.
es: No se encontró "$ENDIF".
fr: $ENDIF non trouvé.
uk: "$ENDIF" не знайдено.

# ParserDirec.ER_UNEXP_ENDIF
source: Unexpected "$ENDIF".
de: Unerwartetes "$ENDIF".
es: No se esperaba "$ENDIF".
fr: "$ENDIF" non attendu.
uk: Непередбачений "$ENDIF".

# ParserDirec.ER_UNEXP_ELSE
source: Unexpected "$ELSE".
de: Unerwartetes "$ELSE".
es: No se esperaba "$ELSE".
fr: "$ELSE" non attendu.
uk: Непередбачений "$ELSE".

# ParserDirec.ER_CONF_UNDEF_
source: Undefined Config. Bit: %s
de: Undefinierte Konfiguration. Bit: %s
es: Bit de Config. no definido: %s
fr: Bit de configuration non défini : %s
uk: Невизначений біт конфігурації: %s

# ParserDirec.ER_INVAL_CBIT_
source: Invalid Config. Bit: %s
de: Ungültige Configuration. Bit: %s
es: Bit de Config. inválido: %s
fr: Bit de configuration invalide : %s
uk: Помилковий біт конфігурації: %s

# ParserDirec.ER_FILE_NO_FND_
source: File no found: %s
de: (Datei nicht gefunden: "%s")
es: Archivo no encontrado: %s
fr: Fichier non trouvé : %s
uk: Файл не знайдено: %s

# ParserDirec.ER_ERIN_NUMBER_
source: Error in number: %s
de: Fehler in der Zahl: %s
es: Error en número: %s
fr: Nombre erroné : %s
uk: Помилка в номері: %s

# ParserDirec.ER_UNKNW_IDENT_
source: Unknown Identifier: %s
de: Unbekannter Bezeichner: %s
es: Identificador desconocido: %s
fr: Identifiant inconnu : %s
uk: Невідомий ідентифікатор: %s

# ParserDirec.ER_DIVIDE_ZERO
source: Cannot divide by zero
es: No se puede dividir por cero
fr: Division par zéro impossible.
uk: Не можу поділити на нуль

# ParserDirec.ER_EVA_ZER_ZER
source: Cannot evaluate 0^0
de: 0^0 kann nicht ausgewertet werden
es: No se puede evaluar 0^0
fr: Impossibilité d'évaluer 0^0
uk: Не можу оцінити 0^0

# ParserDirec.ER_OPE_NOT_IMP_
source: Operator not implemented: %s
de: Operator nicht implementiert: %s
es: Operador no implementado: %s
fr: Opérateur non implémenté : %s
uk: Оператор не реалізовано: %s

# ParserDirec.ER_EXPECT_CAR_
source: Expected "%s"
de: Erwartete "%s"
es: Se esperaba "%s"
fr: Attendu "%s"
uk: Очікується "%s"

# RegWatcher.Label1.Caption
source: Register Watcher
de: Register-Beobachter
es: Inspector de Registros
fr: Observateur de Registres

# RegWatcher.mnClearAll.Caption
source: &Clear All
de: Alle lös&chen
es: Eliminar &Todos
fr: Tout effacer
uk: &Очистити все

# RegWatcher.mnAddVars.Caption
source: Add Program &Variables
de: Programm &Variablen hinzufügen
es: Agregar &Variables
fr: Ajouter &variables programme

# RegWatcher.mnAddRT.Caption
source: Add &Registers
de: Hinzufügen &Register
es: Agregar &Registros
fr: Ajouter &registres

# RegWatcher.TIT_ADD
source: Address
de: Adresse
es: Dirección
fr: Adresse
uk: Адреса

# RegWatcher.TIT_NAM
source: Name
es: Nombre
fr: Nom
uk: Ім'я

# RegWatcher.TIT_VAL
source: Value
de: Wert
es: Valor
fr: Valeur
uk: Значення

# FrameSyntaxTree.TIT_VARS
source: Variables
de: Variablen
uk: Змінні

# FrameMessagesWin.MSG_ERROR
source: Error
de: Fehler
fr: Erreur
uk: Помилка

# FormConfig.tabGeneral.Caption
source: General
de: Allgemein

# FormPrincipal.MSG_PROJECT
source: Project:
de: Projekt:
fr: Projet:
uk: Проект:

# ParserAsm.ER_NOGETVAL_CON
source: Cannot get value of this constant
fr: Impossible d'obtenir l'adresse de cette constante
uk: Не можу отримати значення цієї константи

# FormConfig.lblCodExplCol1.Caption
source: Back color:
fr: Couleur de fond
uk: Колір фону:

# FormConfig.lblCodExplCol2.Caption
source: Text Color:
fr: Couleur du texte
uk: Колір тексту:

# FormConfig.lblMessPan1.Caption
source: Back color
fr: Couleur de fond
uk: Колір фону

# FormConfig.lblMessPan2.Caption
source: Text color:
fr: Couleur du texte:
uk: Колір тексту:

# FormConfig.lblMessPan3.Caption
source: Error color:
fr: Couleur des erreurs:
uk: Колір помилки:

# FormConfig.lblMessPan4.Caption
source: Selection color:
fr: Couleur de sélection:
uk: Колір обраного:

# FormConfig.TIT_CFG_EDITOR
source: Editor
fr: Editeur
uk: Редактор

# CfgSynEdit.chkHighCurLin.Caption
source: Highlight current line
fr: Surbrillance ligne active
uk: Підсвітка поточного рядка

# CfgSynEdit.chkHighCurWord.Caption
source: Highlight current word
fr: Surbrillance mot actif
uk: Підсвітка поточного слова

# CfgSynEdit.chkVerPanVer.Caption
source: Gutter
fr: Marge
